In [1]:
import numpy as np
import pandas as pd

In [2]:
indexes = ['Iran','b','c']
list_py = [10,20,30]
dic = {'a':10 , 'b':20 , 'c':30}

In [3]:
sample = pd.Series(list_py,indexes)

In [4]:
sample

Iran    10
b       20
c       30
dtype: int64

In [5]:
covid19_data = pd.Series(data = [2000,400,1220,587,54789], index = ['Iran' , 'Usa' , 'India' , 'China' , 'France'])

In [6]:
covid19_data * 2

Iran        4000
Usa          800
India       2440
China       1174
France    109578
dtype: int64

In [7]:
covid19_data + sample

China        NaN
France       NaN
India        NaN
Iran      2010.0
Usa          NaN
b            NaN
c            NaN
dtype: float64

In [8]:
columns = ['Q','W','E','R','T']

In [9]:
index = ['A','B','C','D']

In [10]:
data = np.random.randint(-100 , 100 ,  (4,5))

In [11]:
data

array([[ -30,   68, -100,   21,  -70],
       [  24,  -64,   -6,  -11,  -86],
       [  59,   61,   43,   70,  -73],
       [ -22,  -31,   47,   76,  -64]])

In [13]:
df = pd.DataFrame(data,index,columns)

In [77]:
df

    W    E   R   T  new columns
A  68 -100  21 -70           38
B -64   -6 -11 -86          -40
C  61   43  70 -73          120
D -31   47  76 -64          -53

In [16]:
type(df)

pandas.core.frame.DataFrame

In [82]:
df['W']

A    68
B   -64
C    61
D   -31
Name: W, dtype: int32

In [83]:
df[['W','new columns']]

    W  new columns
A  68           38
B -64          -40
C  61          120
D -31          -53

In [33]:
type(df['Q'])

pandas.core.series.Series

In [35]:
df['new columns'] = df['Q'] + df["W"]

In [36]:
df

    Q   W    E   R   T  new columns
A -30  68 -100  21 -70           38
B  24 -64   -6 -11 -86          -40
C  59  61   43  70 -73          120
D -22 -31   47  76 -64          -53

In [38]:
df.drop('Q', axis = 1)

    W    E   R   T  new columns
A  68 -100  21 -70           38
B -64   -6 -11 -86          -40
C  61   43  70 -73          120
D -31   47  76 -64          -53

In [40]:
df

    Q   W    E   R   T  new columns
A -30  68 -100  21 -70           38
B  24 -64   -6 -11 -86          -40
C  59  61   43  70 -73          120
D -22 -31   47  76 -64          -53

In [41]:
df = df.drop('Q',axis=1)

In [42]:
df

    W    E   R   T  new columns
A  68 -100  21 -70           38
B -64   -6 -11 -86          -40
C  61   43  70 -73          120
D -31   47  76 -64          -53

In [44]:
df.loc['A']

W               68
E             -100
R               21
T              -70
new columns     38
Name: A, dtype: int32

In [51]:
type(df.loc[['A','B']])

pandas.core.frame.DataFrame

In [53]:
df.loc[["A","B"]]

    W    E   R   T  new columns
A  68 -100  21 -70           38
B -64   -6 -11 -86          -40

In [56]:
df_new = df.drop('A')

In [58]:
df_new

    W   E   R   T  new columns
B -64  -6 -11 -86          -40
C  61  43  70 -73          120
D -31  47  76 -64          -53

In [67]:
df.iloc[0:2,2:]

    R   T  new columns
A  21 -70           38
B -11 -86          -40

In [84]:
df.loc[['A','B'],['W','new columns']]

    W  new columns
A  68           38
B -64          -40

In [89]:
df.iloc[-1:,-1:]

   new columns
D          -53

In [90]:
df.iloc[-1:]

    W   E   R   T  new columns
D -31  47  76 -64          -53

In [91]:
df

    W    E   R   T  new columns
A  68 -100  21 -70           38
B -64   -6 -11 -86          -40
C  61   43  70 -73          120
D -31   47  76 -64          -53

In [92]:
df >= 0

       W      E      R      T  new columns
A   True  False   True  False         True
B  False  False  False  False        False
C   True   True   True  False         True
D  False   True   True  False        False

In [93]:
df[df >= 0]

      W     E     R   T  new columns
A  68.0   NaN  21.0 NaN         38.0
B   NaN   NaN   NaN NaN          NaN
C  61.0  43.0  70.0 NaN        120.0
D   NaN  47.0  76.0 NaN          NaN

In [98]:
df[df['W'] > 0].iloc[:1]

    W    E   R   T  new columns
A  68 -100  21 -70           38

In [99]:
df.columns

Index(['W', 'E', 'R', 'T', 'new columns'], dtype='object')

In [103]:
df[(df['W'] > 1) & (df['new columns'] >= 0)]

    W    E   R   T  new columns
A  68 -100  21 -70           38
C  61   43  70 -73          120

In [104]:
df.reset_index()

  index   W    E   R   T  new columns
0     A  68 -100  21 -70           38
1     B -64   -6 -11 -86          -40
2     C  61   43  70 -73          120
3     D -31   47  76 -64          -53

In [109]:
index_states = ['Bastam', 'Shahrood', 'Bonab', 'Tabriz']

In [110]:
df['States'] = index_states

In [111]:
df

    W    E   R   T  new columns    States
A  68 -100  21 -70           38    Bastam
B -64   -6 -11 -86          -40  Shahrood
C  61   43  70 -73          120     Bonab
D -31   47  76 -64          -53    Tabriz

In [114]:
df.set_index('States')

           W    E   R   T  new columns
States
Bastam    68 -100  21 -70           38
Shahrood -64   -6 -11 -86          -40
Bonab     61   43  70 -73          120
Tabriz   -31   47  76 -64          -53

In [115]:
df.describe()

               W           E          R          T  new columns
count   4.000000    4.000000   4.000000   4.000000     4.000000
mean    8.500000   -4.000000  39.000000 -73.250000    16.250000
std    66.113539   68.386158  41.448764   9.287088    79.993229
min   -64.000000 -100.000000 -11.000000 -86.000000   -53.000000
25%   -39.250000  -29.500000  13.000000 -76.250000   -43.250000
50%    15.000000   18.500000  45.500000 -71.500000    -1.000000
75%    62.750000   44.000000  71.500000 -68.500000    58.500000
max    68.000000   47.000000  76.000000 -64.000000   120.000000

In [117]:
df.dtypes

W               int32
E               int32
R               int32
T               int32
new columns     int32
States         object
dtype: object

In [120]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, A to D
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   W            4 non-null      int32
 1   E            4 non-null      int32
 2   R            4 non-null      int32
 3   T            4 non-null      int32
 4   new columns  4 non-null      int32
 5   States       4 non-null      object
dtypes: int32(5), object(1)
memory usage: 316.0+ bytes